{
  "title": "Análisis",
  "errorLoadingData": "Error al cargar los datos",
  "loadingData": "Cargando datos...",
  "importTrades": "Importar operaciones",
  "tradingAccount": "Cuenta de trading",
  "year": "Año",
  "month": "Mes",
  "allYears": "Todos los Años",
  "allMonths": "Todos los Meses",
  "reset": "Restablecer",
  "period": "Período",
  "charts": {
    "hourlyPerformanceScatter": {
      "title": "Rendimiento por Hora (Gráfico de Dispersión)",
      "label": "Rendimiento",
      "xAxis": "Hora",
      "yAxis": "PnL"
    },
    "correlation": {
      "title": "Correlación PnL vs Número de Operaciones",
      "label": "Correlación",
      "xAxis": "Número de operaciones",
      "yAxis": "PnL Total",
      "regressionLine": "Línea de regresión",
      "rSquaredTooltip": "El coeficiente de determinación (R²) mide la fuerza de la correlación entre el número de operaciones y el PnL. R² cercano a 1 indica una correlación fuerte, R² cercano a 0 indica una correlación débil. La línea de regresión muestra la tendencia general."
    },
    "drawdown": {
      "title": "Drawdown Diario",
      "label": "Drawdown",
      "yAxis": "Drawdown (%)",
      "tooltip": "Este gráfico muestra la distancia desde tu mejor nivel (pico). La línea en 0 representa tu pico. Cuanto mayor es el valor, más lejos estás de tu mejor nivel. Cuando alcanzas un nuevo pico, el drawdown vuelve a 0. Los porcentajes (%) representan el porcentaje de pérdida desde el pico. Por ejemplo, 10% significa que has perdido 10% en comparación con tu mejor nivel.",
      "amount": "Cantidad",
      "cumulativePnl": "P/L Acumulado",
      "percentage": "Porcentaje",
      "lossFromPeak": "pérdida desde el pico"
    },
    "hourlyPerformanceBars": {
      "title": "Rendimiento por Hora (Barras)",
      "label": "Rendimiento",
      "yAxis": "PnL Total"
    },
    "heatmap": {
      "title": "Rendimiento por Día de la Semana y Hora",
      "losses": "Pérdidas",
      "neutral": "Neutral",
      "gains": "Ganancias",
      "tooltip": "Este mapa de calor muestra tu rendimiento (PnL) por día de la semana y por hora. Cada celda representa el PnL total para una combinación día/hora. Los colores azules indican ganancias, los colores rosas indican pérdidas. Cuanto más intenso es el color, mayor es el valor. Solo se muestran las horas con datos, con una hora de contexto antes y después."
    },
    "pnlDistribution": {
      "title": "Distribución de PnL",
      "label": "Porcentaje de operaciones",
      "yAxis": "Porcentaje de operaciones",
      "range": "P&L: de {{start}} a {{end}}",
      "onTotal": "de {{total}} total",
      "tooltip": "Este gráfico muestra la distribución de tus PnL (ganancias y pérdidas) agrupando las operaciones en intervalos de valores. Cada barra representa un intervalo de PnL y su altura indica el porcentaje de operaciones que se encuentran en ese intervalo. Esto ayuda a identificar los rangos de PnL más frecuentes en tu trading."
    },
    "gainsVsLosses": {
      "title": "Distribución de Ganancias vs Pérdidas",
      "gains": "Ganancias",
      "losses": "Pérdidas",
      "range": "Rango",
      "count": "Cantidad",
      "percentage": "Porcentaje",
      "tooltip": "Este gráfico compara la distribución de tus ganancias y pérdidas por separado. El histograma de la izquierda muestra la distribución de las operaciones ganadoras por rangos de valores, y el de la derecha muestra la distribución de las operaciones perdedoras. Esto ayuda a identificar patrones y comparar la distribución de ganancias y pérdidas para optimizar tu estrategia."
    },
    "monthlyPerformance": {
      "title": "Rendimiento Mensual/Anual",
      "pnl": "PnL",
      "trades": "Operaciones",
      "yAxis": "PnL",
      "tooltip": "Este gráfico muestra tu rendimiento (PnL) por mes. Cada barra representa el PnL total para un mes dado. Esto ayuda a identificar los meses más rentables y las tendencias estacionales."
    },
    "tradingVolume": {
      "title": "Volumen de Trading en el Tiempo",
      "label": "Número de operaciones",
      "yAxis": "Número de operaciones",
      "tooltip": "Este gráfico muestra el número de operaciones por día en el tiempo. Esto ayuda a identificar períodos de actividad intensa y períodos tranquilos."
    },
    "tradesDistribution": {
      "title": "Distribución de Operaciones por Resultado",
      "winners": "Ganadoras",
      "losers": "Perdedoras",
      "neutral": "Neutras",
      "percentage": "Porcentaje",
      "tooltip": "Este gráfico muestra la distribución de tus operaciones entre ganadoras, perdedoras y neutras. Esto permite visualizar rápidamente la proporción de operaciones ganadoras vs perdedoras."
    },
    "riskReward": {
      "title": "Ratio Riesgo/Recompensa en el Tiempo",
      "label": "Ratio R:R promedio",
      "referenceLine": "Referencia (R:R = 1)",
      "trades": "Operaciones",
      "tooltip": "Este gráfico muestra la evolución del ratio riesgo/recompensa (R:R) promedio en el tiempo. Un ratio superior a 1 indica que las ganancias promedio son superiores a las pérdidas promedio. Esto permite evaluar la eficacia de tu gestión del riesgo a lo largo del tiempo."
    }
  },
  "radar": {
    "title": "Métricas de Rendimiento",
    "performance": "Rendimiento",
    "profitFactor": "Factor de Beneficio",
    "winRate": "Tasa de Éxito",
    "recoveryFactor": "Factor de Recuperación",
    "winLossRatio": "Ratio Ganancia/Pérdida",
    "expectancy": "Expectativa",
    "maxDrawdown": "Drawdown Máximo",
    "tooltip": "Este gráfico de radar muestra tus métricas de rendimiento clave normalizadas en una escala de 0 a 100%. Cada eje representa una métrica: Factor de Beneficio, Tasa de Éxito, Factor de Recuperación, Ratio Ganancia/Pérdida, Expectativa y Drawdown Máximo. Cuanto mayor sea el área, mejor será tu rendimiento general."
  },
  "equityCurve": {
    "title": "Curva de Capital",
    "equity": "Capital",
    "initialCapital": "Capital Inicial",
    "dailyPnl": "PnL diario",
    "cumulativePnl": "PnL acumulado",
    "yAxis": "Capital",
    "tooltip": "Este gráfico muestra la evolución de tu capital a lo largo del tiempo. La curva verde representa tu capital actual (capital inicial + PnL acumulado). La línea punteada gris indica tu capital inicial como referencia. Esto te permite visualizar el crecimiento o la disminución de tu capital a lo largo del tiempo."
  },
  "common": {
    "trade": "operación",
    "trades": "operaciones",
    "hour": "{{hour}}h"
  },
  "days": {
    "monday": "Lun",
    "tuesday": "Mar",
    "wednesday": "Mié",
    "thursday": "Jue",
    "friday": "Vie",
    "saturday": "Sáb",
    "sunday": "Dom"
  }
}
